<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="?,8" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="/Cast_output_0,input">
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Concat_118" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="0" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="/features_extractor/flatten/Flatten" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/features_extractor/flatten/Flatten_output_0">
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="mu.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="400, 8" offset="16" size="6400" />
			<output>
				<port id="0" precision="FP16">
					<dim>400</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="mu.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>400</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="mu.0.weight">
					<dim>400</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/mu/mu.0/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>400</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_1602_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 400" offset="6416" size="800" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_1602" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/mu/mu.0/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>400</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mu/mu.0/Gemm_output_0">
					<dim>-1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_17_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="7216" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_17" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/mu/mu.1/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>400</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mu/mu.1/LeakyRelu_output_0">
					<dim>-1</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="mu.2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="300, 400" offset="7218" size="240000" />
			<output>
				<port id="0" precision="FP16">
					<dim>300</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="mu.2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>300</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="mu.2.weight">
					<dim>300</dim>
					<dim>400</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/mu/mu.2/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>400</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>300</dim>
					<dim>400</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_1603_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 300" offset="247218" size="600" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_1603" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/mu/mu.2/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mu/mu.2/Gemm_output_0">
					<dim>-1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_25_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="7216" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_25" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/mu/mu.3/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mu/mu.3/LeakyRelu_output_0">
					<dim>-1</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="mu.4.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="3, 300" offset="247818" size="1800" />
			<output>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="mu.4.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="mu.4.weight">
					<dim>3</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/mu/mu.4/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>300</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_1604_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3" offset="249618" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_1604" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/mu/mu.4/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/mu/mu.4/Gemm_output_0">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="output" type="Tanh" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="output">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="output/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="5" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="1" />
		<edge from-layer="5" from-port="2" to-layer="8" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="11" to-port="0" />
		<edge from-layer="9" from-port="0" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="11" to-port="1" />
		<edge from-layer="11" from-port="2" to-layer="14" to-port="0" />
		<edge from-layer="12" from-port="0" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="17" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="20" to-port="0" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="0" />
		<edge from-layer="19" from-port="1" to-layer="20" to-port="1" />
		<edge from-layer="20" from-port="2" to-layer="23" to-port="0" />
		<edge from-layer="21" from-port="0" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="1" to-layer="23" to-port="1" />
		<edge from-layer="23" from-port="2" to-layer="26" to-port="0" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="26" to-port="1" />
		<edge from-layer="26" from-port="2" to-layer="27" to-port="0" />
		<edge from-layer="27" from-port="1" to-layer="28" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2024.6.0-17404-4c0f47d2335-releases/2024/6" />
		<Runtime_version value="2024.6.0-17404-4c0f47d2335-releases/2024/6" />
		<conversion_parameters>
			<input_model value="DIR/footsteps_planning_right.onnx" />
			<is_python_api_used value="False" />
		</conversion_parameters>
		<legacy_frontend value="False" />
	</rt_info>
</net>
